In [41]:
# Importar librería Pandas
import pandas as pd

In [42]:
fbk = ['Facebook', 2449, True,2006]
twt = ['Twitter',339 , False,2006]
ig = ['Instagram',1000, True,2010]
yt = ['Youtube',2000, False,2005]
lkn = ['Linkedin' , 663, False,2003]
wsp = ['Whatsapp',1600, True,2009]

In [43]:
#Agregar en la lista las Redes sociales
lista_rrss =[fbk,twt,ig,yt,lkn,wsp]

In [44]:
# Crear el dataframse con las columnas requeridas
df_rrss= pd.DataFrame(lista_rrss, columns=["Nombre","Cantidad","Es_Fbk","Anio"])

In [45]:
df_rrss

      Nombre  Cantidad  Es_Fbk  Anio
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010
3    Youtube      2000   False  2005
4   Linkedin       663   False  2003
5   Whatsapp      1600    True  2009

In [46]:
# Se puede crear un dataframe vacio con las columnas en caso requerido
df_vacio = pd.DataFrame(columns=["Nombre","Cantidad","Es_Fbk","Anio"])
df_vacio

Empty DataFrame
Columns: [Nombre, Cantidad, Es_Fbk, Anio]
Index: []

In [47]:
# Se agrega la info al dataframse vacio
df_vacio = df_vacio.append({'Nombre':'Facebook',
                            'Cantidad':2249,
                            'Es_fbk' : True,
                            'Anio':2006}, ignore_index=True)

C:\Users\carol\AppData\Local\Temp\ipykernel_8684\3640963571.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_vacio = df_vacio.append({'Nombre':'Facebook',

In [48]:
df_vacio

     Nombre Cantidad Es_Fbk  Anio Es_fbk
0  Facebook     2249    NaN  2006   True

In [49]:
df_rrss

      Nombre  Cantidad  Es_Fbk  Anio
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010
3    Youtube      2000   False  2005
4   Linkedin       663   False  2003
5   Whatsapp      1600    True  2009

In [60]:
# Mostrar por nombre y la fila 4
df_rrss.loc[4,'Nombre']

'Linkedin'

In [51]:
#Ubicado por entero
df_rrss.iloc[1,0]

'Twitter'

In [52]:
df_rrss['Nombre']

0     Facebook
1      Twitter
2    Instagram
3      Youtube
4     Linkedin
5     Whatsapp
Name: Nombre, dtype: object

In [53]:
# Ubicar info según fila
df_rrss.iloc[4]

Nombre      Linkedin
Cantidad         663
Es_Fbk         False
Anio            2003
Name: 4, dtype: object

In [54]:
# Booleano mayor a 1500
df_rrss['Cantidad'] > 1500

0     True
1    False
2    False
3     True
4    False
5     True
Name: Cantidad, dtype: bool

In [55]:
# Toma la información filtrada y muestra solo lo necesario > 1500
df_rrss[df_rrss['Cantidad'] >1500]

     Nombre  Cantidad  Es_Fbk  Anio
0  Facebook      2449    True  2006
3   Youtube      2000   False  2005
5  Whatsapp      1600    True  2009

In [56]:
# Orden ascendente
df_rrss.sort_values('Nombre', ascending = True)

      Nombre  Cantidad  Es_Fbk  Anio
0   Facebook      2449    True  2006
2  Instagram      1000    True  2010
4   Linkedin       663   False  2003
1    Twitter       339   False  2006
5   Whatsapp      1600    True  2009
3    Youtube      2000   False  2005

In [57]:
# Orden descendente
df_rrss.sort_values('Cantidad', ascending = False)

      Nombre  Cantidad  Es_Fbk  Anio
0   Facebook      2449    True  2006
3    Youtube      2000   False  2005
5   Whatsapp      1600    True  2009
2  Instagram      1000    True  2010
4   Linkedin       663   False  2003
1    Twitter       339   False  2006

In [59]:
# Ordenar por mas valores
df_rrss.sort_values(['Anio','Cantidad'], ascending=[True,False])

      Nombre  Cantidad  Es_Fbk  Anio
4   Linkedin       663   False  2003
3    Youtube      2000   False  2005
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
5   Whatsapp      1600    True  2009
2  Instagram      1000    True  2010